"""
Модуль конфігурації додатка (App) для роботи з аніме.

Цей файл містить налаштування для додатка `anime_api`, 
які вказують Django, як саме його ініціалізувати в загальній системі.
"""
from django.apps import AppConfig


class AnimeApiConfig(AppConfig):
    """
    Клас конфігурації додатка anime_api.
    
    Використовується Django для підключення додатка, його моделей, 
    маршрутів та специфічних налаштувань до основного проєкту.
    """
    name = 'anime_api'
    """str: Повна системна назва додатка в межах проєкту."""
